app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        render json: User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
    def show
        render json: User.find(params[:id])

INSERT INTO "users" ("created_at", "last_name", "name", "quote", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 11 Feb 2014 21:50:33 UTC +00:00], ["last_name", "Dallimore"], ["name", "Tom"], ["quote", "hehehehe"], ["updated_at", Tue, 11 Feb 2014 21:50:33 UTC +00:00]]
---
    def create
      user = User.new(user_params)

      if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "quote" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["quote", "I'm just singin' in the rain!!"], ["updated_at", Tue, 11 Feb 2014 21:50:18 UTC +00:00]]
---
    def update
      user = User.find(params[:id])

      if user.update_attributes(user_params)